TASK2:DESCRIPTIVE ANALYSIS

In [1]:
import pandas as pd

In [2]:
df=pd.read_csv("Dataset Internship.csv")

In [3]:
df.info() #Basic information about dataset

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9551 entries, 0 to 9550
Data columns (total 21 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   Restaurant ID         9551 non-null   int64
 1   Restaurant Name       9551 non-null   object
 2   Country Code          9551 non-null   int64
 3   City                  9551 non-null   object
 4   Address               9551 non-null   object
 5   Locality              9551 non-null   object
 6   Locality Verbose      9551 non-null   object
 7   Longitude             9551 non-null   float64
 8   Latitude              9551 non-null   float64
 9   Cuisines              9542 non-null   object
 10  Average Cost for two  9551 non-null   int64
 11  Currency              9551 non-null   object
 12  Has Table booking     9551 non-null   object
 13  Has Online delivery   9551 non-null   object
 14  Is delivering now     9551 non-null   object
 15  Switch to order menu  9551 non-null   object
 16  Price range           9551 non-null   int64
 17  Aggregate rating      9551 non-null   float64
 18  Rating color          9551 non-null   object
 19  Rating text           9551 non-null   object
 20  Votes                 9551 non-null   int64
dtypes: float64(3), int64(5), object(13)
memory usage: 1.5+ MB

In [5]:
df.describe() #statistical measures for numerical columns

,Restaurant ID,Country Code,Longitude,Latitude,Average Cost for two,Price range,Aggregate rating,Votes
count,9.551000e+03,9551.000000,9551.000000,9551.000000,9551.000000,9551.000000,9551.000000,9551.000000
mean,9.051128e+06,18.365616,64.126574,25.854381,1199.210763,1.804837,2.666370,156.909748
std,8.791521e+06,56.750546,41.467058,11.007935,16121.183073,0.905609,1.516378,430.169145
min,5.300000e+01,1.000000,-157.948486,-41.330428,0.000000,1.000000,0.000000,0.000000
25%,3.019625e+05,1.000000,77.081343,28.478713,250.000000,1.000000,2.500000,5.000000
50%,6.004089e+06,1.000000,77.191964,28.570469,400.000000,2.000000,3.200000,31.000000
75%,1.835229e+07,1.000000,77.282006,28.642758,700.000000,2.000000,3.700000,131.000000
max,1.850065e+07,216.000000,174.832089,55.976980,800000.000000,4.000000,4.900000,10934.000000

In [18]:
mean_values = df.select_dtypes(include='number').mean()
print("\n Mean:\n",mean_values)

 Mean:
 Restaurant ID           9.051128e+06
Country Code            1.836562e+01
Longitude               6.412657e+01
Latitude                2.585438e+01
Average Cost for two    1.199211e+03
Price range             1.804837e+00
Aggregate rating        2.666370e+00
Votes                   1.569097e+02
dtype: float64

In [19]:
median_values=df.select_dtypes(include='number').median()
print("\n Median:\n",median_values)

 Median:
 Restaurant ID           6.004089e+06
Country Code            1.000000e+00
Longitude               7.719196e+01
Latitude                2.857047e+01
Average Cost for two    4.000000e+02
Price range             2.000000e+00
Aggregate rating        3.200000e+00
Votes                   3.100000e+01
dtype: float64

In [20]:
mode_values=df.select_dtypes(include='number').mode()
print("\nMode:\n",mode_values)

Mode:
       Restaurant ID  Country Code  Longitude  Latitude  Average Cost for two  \
0                53           1.0        0.0       0.0                 500.0
1                55           NaN        NaN       NaN                   NaN
2                60           NaN        NaN       NaN                   NaN
3                64           NaN        NaN       NaN                   NaN
4                65           NaN        NaN       NaN                   NaN
...             ...           ...        ...       ...                   ...
9546       18499493           NaN        NaN       NaN                   NaN
9547       18500618           NaN        NaN       NaN                   NaN
9548       18500628           NaN        NaN       NaN                   NaN
9549       18500639           NaN        NaN       NaN                   NaN
9550       18500652           NaN        NaN       NaN                   NaN

      Price range  Aggregate rating  Votes
0             1.0               0.0    0.0
1             NaN               NaN    NaN
2             NaN               NaN    NaN
3             NaN               NaN    NaN
4             NaN               NaN    NaN
...           ...               ...    ...
9546          NaN               NaN    NaN
9547          NaN               NaN    NaN
9548          NaN               NaN    NaN
9549          NaN               NaN    NaN
9550          NaN               NaN    NaN

[9551 rows x 8 columns]

In [22]:
Standard_Deviation=df.select_dtypes(include='number').std()
print('\nStandard Deviation:\n',Standard_Deviation)

Standard Deviation:
 Restaurant ID           8.791521e+06
Country Code            5.675055e+01
Longitude               4.146706e+01
Latitude                1.100794e+01
Average Cost for two    1.612118e+04
Price range             9.056088e-01
Aggregate rating        1.516378e+00
Votes                   4.301691e+02
dtype: float64

In [27]:
print("UNIQUE COUNTRY CODE")
df['Country Code'].value_counts()  #unique values in Country code column

UNIQUE COUNTRY CODE

Country Code
1      8652
216     434
215      80
30       60
189      60
214      60
148      40
208      34
14       24
162      22
94       21
166      20
184      20
191      20
37        4
Name: count, dtype: int64

In [28]:
print("UNIQUE CITIES")
df['City'].value_counts() #unique values in City column

UNIQUE CITIES

City
New Delhi         5473
Gurgaon           1118
Noida             1080
Faridabad          251
Ghaziabad           25
                  ...
Lakes Entrance       1
Mohali               1
Panchkula            1
Bandung              1
Randburg             1
Name: count, Length: 141, dtype: int64

In [31]:
print("UNIQUE CUISINES")
df['Cuisines'].value_counts()  #unique values in Cuisines column

UNIQUE CUISINES

Cuisines
North Indian                          936
North Indian, Chinese                 511
Chinese                               354
Fast Food                             354
North Indian, Mughlai                 334
                                     ...
World Cuisine, Patisserie, Cafe         1
Burger, Izgara                          1
Desserts, B�_rek                        1
Restaurant Cafe, Turkish, Desserts      1
Restaurant Cafe, Desserts               1
Name: count, Length: 1825, dtype: int64

In [33]:
#Top Cuisines
print("TOP CUISINES")
df['Cuisines'].value_counts().head(10)

TOP CUISINES

Cuisines
North Indian                      936
North Indian, Chinese             511
Chinese                           354
Fast Food                         354
North Indian, Mughlai             334
Cafe                              299
Bakery                            218
North Indian, Mughlai, Chinese    197
Bakery, Desserts                  170
Street Food                       149
Name: count, dtype: int64

In [34]:
#Top Cities
print("TOP CITIES")
df['City'].value_counts().head(10)

TOP CITIES

City
New Delhi       5473
Gurgaon         1118
Noida           1080
Faridabad        251
Ghaziabad         25
Bhubaneshwar      21
Lucknow           21
Ahmedabad         21
Amritsar          21
Guwahati          21
Name: count, dtype: int64